package ch17moderate;

// TBD 1
/**
 * 17.1 수 하나를 이동 없이 바꾸는 함수르 작성하라 (즉, 임시 변수는 사용할 수 없다.)
 */

// TBD 2
/**
 * 17.2 틱-택-토(tic-tac-toe) 게임의 승자를 알아내는 알고리즘을 설계하라.
 */

// TBD 3
/**
 * 17.3 n!의 계산 결과로 구해진 값의 마지막에 붙은 연속된 0의 개수를 계산하는 알고리즘을 작성하라.
 */

// TBD 4
/**
 * 17.4 주어진 두 수의 최댓값을 찾는 메서드를 작성하라.
 *      if-else 나 비교 연산자는 사용할 수 없다.
 */

// TBD 5...
/**
 * 17.5 마스터 마인드 게임
 */

// TBD 6
/**
 * 17.6 정수 배열이 주어졌을 때, m 부터 n 까지의 원소를 정렬하기만 하면 배열 전체가 정렬되어버리는 m 과 n 을 찾아라.
 *      n - m 이 최소화되도록 하라. (다시 말해, 그런 순열 중 가장 짧은 것을 찾아야 한다.)
 *
 *      - 예
 *          입력: 1, 2, 3, 6, 10, 11, 7, 12, 6, 7, 16, 18, 19
 *          출력: (3, 9)
 */

// TBD 7
/**
 * 17.7 주어진 정수를 영어로 변환하여 출력하여라.
 *      (One Thousand 나 Two Hundred Thirty Four 와 같이 출력하면 된다.)
 */

// TBD 8
/**
 * 17.8 정수 배열이 주어진다 (이 배열에는 양수 음수 모두 허용된다).
 *      가장 큰 합을 갖는 연속 수열을 찾고 그 합을 반환하라.
 *
 *      - 예
 *          입력: 2, -8, 3, -2, 4, -10
 *          출력: 5 ({3, -2, 4} 의 합이다다
 */

// TBD 9
/**
 * 17.9 어떤 책에서 주어진 단어의 출현 빈도를 계산하는 메서드를 설계하라.
 */

// TBD 10 ...
/**
 * 17.10 XML 에는 너무 많은
 */

// TBD 11
/**
 * 17.11 rand5() 를 이용하여 rand7() 을 작성하라.
 *        rand5() 는 0부터 4까지의 난수를 생성하는 메서드고,rand7() 은 0부터 6까지의 난수를 발생시키는 메서드다.
 */

// TBD 12
/**
 * 17.12 합한 값이 지정된 정수가 되는, 배열 내의 모든 정수 쌍을 찾는 알고리즘을 설게하라.
 */

// WIP 13...
/**
 * 17.13 BiNode
 */

// WIP 14 ...
/**
 * 17.14 아 이런! 긴 문서 하나를 편집하다가 실수로
 */

//--------------------------------------------------------------------------------
// Korean Edition: Unsolved -->
//--------------------------------------------------------------------------------


//--------------------------------------------------------------------------------
// English Edition: Unsolved --> 4E(), 6E()
//--------------------------------------------------------------------------------
public class Moderate {
}
